package com.example.finalrecycleview;

import java.util.ArrayList;

public class Data {
    public static ArrayList<Information> getData(){
        ArrayList<Information> data = new ArrayList<>();
        int[] myimages ={
                R.drawable.first,
                R.drawable.eighth,
                R.drawable.third,
                R.drawable.second,
                R.drawable.sixth,
                R.drawable.fifth,
                R.drawable.forth,
                R.drawable.seventh
        };
        String [] myname ={"انتيخريستوس","ارض زيكولا","الفيل الازرق","ساق البامبو","تراب الماس","هيبتا","ثلاثيه غرناطه","يوتوبيا"};
        String [] myauthor={"احمد خالد مصطفى","عمرو عبدالحميد","احمد مراد","سعود السنوسى","احمد مراد","محمد صادق","رضوى عاشور","احمد خالد توفيق"};
        String [] mydesc={
                " لديك عادة بشرية سخيفة .. تحب أن تقرأ تلك السطور القليلة خلف كل رواية .. ثم تقرر لو كنت ستأخذها معك أو تتركها على الرف .. أنا لا تهمني رغباتك البشرية هذه ولا يهمني لو أخذت الرواية أو تركتها .. لكن طالما أنت هنا .. فمن واجبي أن أنقل لك رسالة هامة .. تذكر دائما أيها البشري .. إن أنتيخريستوس ليس هو ربك .. مهما رأيته يميت أناساً ثم يحييهم .. حتى وإن رأيته يشير إلى السماء فتمطر .. ويشير إلى الأرض فتنبت .. تذكر دائماً .. إن أنتيخريستوس .. ليس هو ربك",
                "هل جرّبت أن تتعامل بعملة مختلفة عن العملات الورقية .. ليست معدنية وليست ذهبية ...الثروة هنا من نوع آخر ... لن تدفع مالاً لتأخذ ..بل ستدفع من ذكائك ...ستدفع من وحدات عقلك... ولكن انتبه فـ للثروة حدود ...فهنا المفلس لا يعامل باحتقار أو يُهان كما يحدث في عالمك .. بل يتعرض للموت .. احذر .. فأنت .. في أرض زيكولا وبطلها الملك المظفر قطز يضرب بنزاهته وعدلة، وشجاعته وحزمه، وصبره وعزمه ، ووفائه",
                        "  بعد خمس سنوات من العُزلة الاختيارية يستأنف د. يحيي عمله في مستشفى العباسية للصحّة النفسية\n" +
                                "حيث يجد في انتظاره مفاجأة.. في 8 غرب، القسم الذي يقرّر مَصير مُرتكبي الجرائم، يُقابل صديق قديم يحمل إليه ماضي جاهد طويلاً لينساه،\n" +
                                " ويصبح مَصيره فجأة بين يدي يحيي.. تعصِف المفاجآت بيحيي وتنقلب حياته رأسًا على عقب، ليصبح ما بدأ كمحاولة لاكتشاف حقيقة صديقه، رحلة مثيرة لاكتشاف نفسه.. أو ما تبقى منها\n","لماذا كان جلوسي تحت الشجرة يزعج أمي؟ أتراها كانت تخشى أن تنبت لي جذور تضرب في عمق الأرض ما يجعل عودتي إلى بلاد أبي أمراً مستحيلاً؟..ربما،\n" +
                " ولكن، حتى الجذور لا تعني شيئاً أحياناً.\n" +
                " لو كنت مثل نبتة البامبو.. لا انتماء لها.. نقتطع جزءاً من ساقها.. نغرسه، بلا جذور، في أي أرض.. لا يلبث الساق طويلاً حتى تنبت له جذور جديدة..\n" +
                " تنمو من جديد.. في أرض جديدة.. بلا ماض.. بلا ذاكرة.. لا يلتفت إلى اختلاف الناس حول تسميته.. كاوايان في الفلبين.. خيزران في الكويت.. أو بامبو في أماكن أخرى.\n","  للمرة الثانية بعد فيرتيجو يتّخذ أحمد مراد من الجريمة خلفية تكشف بأسلوب\n" +
                " مشوّق كواليس المجتمع و الفساد المستشري وسط كل طبقاته.. وهو بذلك يؤّكد قواعد النوع الروائي الذي أصبح رائدًا له..\n" +
                " صنع الله إبراهيم\n" +
                "لم يكن طه سوى مندوب دعاية طبية في شركة أدوية؛ حياة باهتة رتيبة، بدلة و كرافتة و حقيبة جلدية و لسان لبق يستميل أعتى الأطباء لأدويته\n" +
                " وفي البيت يعيش وحيدًا مع أبيه القعيد\n" +
                " كان ذلك قبل أن تقع جريمة قتل غامضة تتركه خلفها و قد تبدّل عالمه.. للأبد\n" +
                "  تتحول حياته إلى جزيرة من الأسرار، يبدأ اكتشافها في دفتر عتيق يعثر عليه مصادفة، و يجد معه أداة رهيبة لها فعل السحر\n" +
                "عندها يبدأ طه ومعه الضابط وليد سلطان في تتبع قاتل لا يملكان دليلا ضده\n" +
                "سنقرأ هنا كيف تتحول هذه الجريمة إلى سلسلة من عمليات القتل. وكيف\n" +
                "يصبح القتل بابًا يكشف لنا عالما من الفساد، وسطوة السلطة التي تمتد لأجيال في تتابع مثير لا يؤكد أبدا أن \\\"طه\\\" سيصل إلى نهايته\n"," تأخذنا رواية (هيبتا) إلي ذلك العالم الذي أهلكه الجميع بحثا ..\n" +
                " ذلك العالم الذي رغم تكرار قصصه ورواياته إلا أن الجميع فيه يقع في نفس الأخطاء، ويعيد نفس الأحداث، و يتألم نفس الألم ..\n" +
                "خلال محاضرة مدتها ست ساعات يأخذنا (أسامة) المحاضر إلى حالات نادرة ..\n" +
                "ورغم ندرتها لن تستطيع إلا أن تجد نفسك فيها ..\n" +
                "في عالم الحب والأمل والألم .. من خلال حالات نعيشهم و نفهم منهم تلك المراحل السبع التي لخصت كل القواعد .. قواعد الـهيبتا\n"," في وحشة سجنك ترى أحبابك أكثر، لأن في الوقت متسعًا، ولأنهم يأتونك حدبا في محنتك، ويتركون لك أن تتملى وجوههم ما شئت وإن طال تأملك . رواية ثلاثية غرناطة هي ثلاثية روائية تتكون من ثلاث روايات للكاتبة المصرية رضوى عاشور و هم على التوالي : غرناطة مريمة الرحيل و تدور الأحداث في مملكة غرناطة بعد سقوط جميع الممالك الإسلامية في الأندلس،\n" +
                " و تبدأ أحداث الثلاثية في عام 1491 و هو العام الذي سقطت فيه غرناطة بإعلان المعاهدة التي تنازل بمقتضاها أبو عبد الله محمد الصغير آخر ملوك غرناطة عن ملكه لملكي قشتالة و أراجون و تنتهى بمخالفة آخر أبطاالها الأحياء على لقرار ترحيل المسلمين حينما يكتشف أن الموت في الرحيل عن الأندلس و ليس في البقاء\n"," كيف ستكون مصر عام 2023؟\n" +
                "لقد عزَلَ الأغنياء أنفسهم في (يوتوبيا) الساحل الشمالي تحت حراسة المارينز الأمريكيين، يتعاطون المخدرات\n" +
                "ويمارسون المتع المحرمة إلى أقصاها، بينما ينسحق الفقراء خارجها ينهش بعضهم لحم بعض من أجل العيش، دونما كهرباء أو صرف صحي\n" +
                "أو رعاية طبية من أي نوع. ولكن حين يتسلل الراوي وصديقته (جرمينال) خارج (يوتوبيا) بدافع الملل وبحثا عن (صيد بشري)\n" +
                " مناسب يحدث ما يهدد الوضع المستقر بالانفجار.\n" +
                "فيما يشبه هول علامات يوم القيامة، تدق هذه الرواية المثيرة ناقوس الخطر، تكاد تشك إذ\n" +
                "تنهيها أهي بالفعل رواية متخيلة، أم إن كاتبها تسلل من المستقبل القريب لينقل لك هوله بحياد مذهل؟\n"};

        for ( int i=0 ; i < myimages.length ; i++){
            Information current =new Information();
            current.images = myimages[i];
            current.name = myname[i];
            current.author = myauthor[i];
            current.description = mydesc[i];
            data.add(current);
        }

    return data;

    }
}
